:PROPERTIES:
:ID:       304b3279-25ba-41f1-a4fc-4215c143ab35
:END:
#+TITLE: Rust
#+DESCRIPTION: The Rust Language
#+TAGS:

#+PROPERTY: header-args+ :var ectoRoot=(expand-file-name "rust" (or (bound-and-true-p dc/ecto-path) "/data/ecto"))
#+PROPERTY: header-args+ :var repoRoot=(expand-file-name "rust" (or (bound-and-true-p dc/repo-path) "/data/repo"))


**** Extract cargo category slugs from =https://crates.io=

I totally forgot I had the the Crates.io source on my machine... dumbass.

And that was the fastest way to find the answer, really. It's an ember app and
the slugs are keys in =./boot/categories.toml=

#+name: categories
#+begin_src sh :results output silent
f=src/boot/categories.toml
project=$ectoRoot/cargo/crates.io
cat $project/$f \
    | grep -e '^\[' \
    | sed -e 's/\.categories//g' \
    | sed -e 's/^\[\(.*\)\]/\1/g' \
    | sed -e 's/\./\//g'
#+end_src

#+name: categoriesDirp
#+headers: :var cats=categories
#+begin_src sh :results output verbatim :exports both
dirp=$(mktemp -d)

echo -n $cats | while read -r -d' ' c; do
                   mkdir -p $dirp/$c
             done

tree $dirp | tr ' ' ' ' #| sed -e 's/\[ \]+/ /g'
#+end_src

#+RESULTS: categoriesDirp
#+begin_example
/tmp/tmp.BjwRl9efmh
├── accessibility
├── aerospace
│     ├── drones
│     ├── protocols
│     ├── simulation
│     ├── space-protocols
│     └── unmanned-aerial-vehicles
├── algorithms
├── api-bindings
├── asynchronous
├── authentication
├── caching
├── command-line-interface
├── command-line-utilities
├── compilers
├── compression
├── computer-vision
├── concurrency
├── config
├── cryptography
│     └── cryptocurrencies
├── database
├── database-implementations
├── data-structures
├── date-and-time
├── development-tools
│     ├── build-utils
│     ├── cargo-plugins
│     ├── debugging
│     ├── ffi
│     ├── procedural-macro-helpers
│     ├── profiling
│     └── testing
├── email
├── embedded
├── emulators
├── encoding
├── external-ffi-bindings
├── filesystem
├── finance
├── game-development
├── game-engines
├── games
├── graphics
├── gui
├── hardware-support
├── internationalization
├── localization
├── mathematics
├── memory-management
├── multimedia
│     ├── audio
│     ├── encoding
│     ├── images
│     └── video
├── network-programming
├── no-std
│     └── no-alloc
├── os
│     ├── freebsd-apis
│     ├── linux-apis
│     ├── macos-apis
│     ├── unix-apis
│     └── windows-apis
├── parser-implementations
├── parsing
├── rendering
│     ├── data-formats
│     ├── engine
│     └── graphics-api
├── rust-patterns
├── science
│     ├── geo
│     ├── neuroscience
│     └── robotics
├── simulation
├── template-engine
├── text-editors
├── text-processing
├── value-formatting
├── virtualization
├── visualization
├── wasm
└── web-programming
    ├── http-client
    └── http-server

87 directories, 0 files
#+end_example

